//
//  Model.swift
//  Tiger Gym
//
//  Created by Mohamed Elshaer on 4/4/20.
//  Copyright © 2020 Mohamed Elshaer. All rights reserved.
//

import Foundation

struct ScheduleData {
    
    static var shared = ScheduleData()
    
    // Main VC
    let mainTrainType = ["Genral","Bulk (A)","Bulk (B)","Loss (A)","Loss (B)","Superset","Definition"]
    
    // Day Table VC
    let trainDay = ["Chest","Back","Shoulder","Arm","Leg"]
    let lossTrainDay = ["Chest & Try","Back & Bai","Shoulder & Leg","Cardio"]
    let superTrainDay = ["Chest & Back", "Shoulder & Leg", "Arm"]
    let genralDay = ["First Day","Second & Third Day"]
    
    //MARK:- The Train VC
    // Genral Table
    let genralTable = ["سحب عالي امامي","سحب جالس ضيق","صدر عالي","صدر فلات","تجميع جانبي","تجميع امامي","باي","تراي","رجل امامي","رجل خلفي","قطنيه","بطن امامي"]

    // Bulk A Train
    let bulk_A_ChestTable = ["إطالات","صدر فلات","صدر عالي","تجميع فلات","تجميع عالي","تجميع مقلوب","تفتيح","تراي مقلوب","تويست","بطن جانبي"]
    let bulk_A_BackTable = ["إطالات","سحب عالي امامي","طرنبه ضيق","فردي ضهر ضيق","سحب جالس ضيق","طرنبه واسع","سحب جالس واسع","ساعد","قطنيه","بطن امامي"]
    let bulk_A_SholTable = ["إطالات","تجميع جانبي","تجميع امامي","رفرفه جانبي","رفرفه امامي","رفرفه خلفي","سحب امامي","ترابيس","تويست","بطن جانبي"]
    let bulk_A_ArmTable = ["إطالات","باي واقف واسع","فردي ارتكاز","بار ارتكاز ضيق","همر","بار صدر ضيق","تجميع فرنساوي","تراي نايم بار","رفص كبلات","قطنيه","بطن امامي"]
    let bulk_A_LegTable = ["إطالات","سكوات واسع","دفع 11","رجل امامي","رجل خلفي","سمانه واقف","سمانه جالس","رست"]
    
    // Bulk B Train
    let bulk_B_ChestTable = ["إطالات","صدر عالي","تجميع عالي","صدر فلات","تجميع فلات","تجميع مقلوب","تفتيح","تراي ضيق","تويست","بطن جانبي"]
    let bulk_B_BackTable = ["إطالات","سحب عالي امامي","سحب عالي ضيق","فردي ضهر ضيق","طرنبه واسع","فردي واسع","سحب جالس واسع","ساعد","قطنيه","بطن امامي"]
    let bulk_B_SholTable = ["إطالات","تجميع جانبي","رفرفه جانبي","تجميع امامي","رفرفه امامي","كتف خلفي سحب عالي","رفرفه خلفي","ترابيس","تويست","بطن جانبي"]
    let bulk_B_ArmTable = ["إطالات","تراي حبل","تراي فردي نايم","تراي نايم بار","تراي مقلوب","باي ارتكاز ضيق","تبادل واقف","باي واقف","همر","قطنيه","بطن امامي"]
    let bulk_B_LegTable = ["إطالات","سكوات واسع","دفع 11","طعن","رجل امامي","رجل خلفي","سمانه واقف","سمانه جالس","رست"]
    
    // Loss A Train
    let loss_A_ChestTable = ["مشي سريع","إطالات","صدر فلات","صدر عالي","تفتيح","تراي صدر ضيق","تراي حبل","تراي مقلوب","مشايه","عجله","تويست","بطن جانبي"]
    let loss_A_BackTable = ["مشي سريع","إطالات","سحب عالي امامي","سحب جالس ضيق","سحب جالس واسع","باي واقف","باي تبادل","همر","مشايه","عجله","قطنيه","بطن امامي"]
    let loss_A_Shol_LegTable = ["مشي سريع","إطالات","تجميع جانبي","تجميع امامي","رفرفه خلفي","سكوات حر","رجل امامي","رجل خلفي","سمانه جالس","مشايه","عجله","تويست","بطن جانبي"]
    let loss_A_CarTable = ["إطالات","مشايه","عجله","قطنيه","بطن امامي"]
    
    // Loss B Train
    let loss_B_PunchTable = ["مشي سريع","إطالات","تجميع فلات","تجميع عالي","تفتيح","ضغط ضيق","تراي حبل","بار نايم زجزاج","مشايه","عجله","تويست","بطن جانبي"]
    let loss_B_BackTable = ["مشي سريع","إطالات","سحب عالي امامي","فردي ضهر ضيق","فردي ضهر واسع","باي واقف","فردي ارتكاز","ساعد","مشايه","عجله","قطنيه","بطن امامي"]
    let loss_B_Shol_LegTable = ["مشي سريع","إطالات","رفرفه جانبي","رفرفه امامي","رفرفه خلفي","طعن","رجل امامي تبادل","رجل خلفي تبادل","سمانه جالس","مشايه","عجله","تويست","بطن جانبي"]
    let loss_B_CarTable = ["إطالات","مشايه","عجله","قطنيه","بطن امامي"]
    
    // Super Set
    let super_Chest_BackTable = ["إطالات","صدر فلات","سحب عالي امامي","صدر عالي","سحب جالس ضيق","تفتيح","سحب جالس واسع","تجميع مقلوب","طرنبه واسع","تويست","بطن جانبي"]
    let super_Shol_LegTable = ["إطالات","تجميع جانبي","رجل امامي","تجميع امامي","رجل خلفي","رفرفه خلفي","سمانه واقف","ترابيس","سمانه جالس","قطنيه","بطن امامي"]
    let super_ArmTable = ["إطالات","تراي نايم بار","بار ارتكاز واسع","تراي مقلوب","بار ارتكاز ضيق","تجميع فرنساوي","تجميع همر","عقله ضيق همر","ضغط ضيق","تويست","بطن جانبي"]
    
    // Denifition
    let denf_ChestTable = ["إطالات متحركه","تجميع فلات دوران للخارج","تجميع عالي دوران للداخل","تفتيح مقلوب","تفتيح عالي","اوفر صدر واسع","تراي غطس","مشايه","عجله","تويست","بطن جانبي"]
    let denf_BackTable = ["إطالات متحركه","سحب عالي امامي","فردي ضهر ضيق","سحب ضيق","سحب منشاريات","سحب جالس واسع","عقله همر","مشايه","عجله","قطنيه","بطن امامي"]
    let denf_SholTable = ["إطالات متحركه","تجميع جانبي دوران للداخل","رفرفه جانبي","رفرفه امامي بالطاره","رفرفه خلفي","ترابيس","متوازي","مشايه","عجله","تويست","بطن جانبي"]
    let denf_ArmTable = ["إطالات متحركه","تبادل دوران للخارج","بار ارتكاز ضيق","همر تجميع ارتكاز","تراي حبل","تراي فردي مقلوب","ضغط ضيق","مشايه","عجله","قطنيه","بطن امامي"]
    let denf_LegTable = ["إطالات متحركه","سكوات واسع","طعن","رجل امامي","رجل خلفي","سمانه واقف","سمانه جالس","مشايه","عجله","تويست","بطن جانبي"]
    
    
    // Train VC
    let bulk_A = "12 10 8 8"
    let loss = "15 20 25"
    let higher = "Lower - Higher"
    let theLoss = "Higher - Lower"
    let genWeight = "Same Lower"
    let min5 = "5 Min"
    let min15 = "15 Min"
    let min20 = "20 Min"
    let empty = "-"
    let train15 = "15 15 15"
    let train8 = "8 8 8"
    let train103 = "10 10 10"
    let train104 = "10 10 10 10"
    
    // Tone VC
    var toneName = "Ascending"
    
}
